using System;
// Создаём интерфейс "Рисунок".
// Интерфейс содержит методы, которые должен поддерживать класс холста.
interface IDrawing
{
    // Метод для рисования линии.
    void DrawLine();
    // Метод для рисования круга.
    void DrawCircle();
    // Метод для рисования прямоугольника.
    void DrawRectangle();
}
// Создаём класс "Canvas". Он представляет холст, на котором можно рисовать.
// После : IDrawing указываем, что класс реализует интерфейс IDrawing.
class Canvas : IDrawing
{
    // Реализуем метод рисования линии.
    public void DrawLine()
    {
        Console.WriteLine(
            "Нарисована линия."
        );
    }
    // Реализуем метод рисования круга.
    public void DrawCircle()
    {
        // Выводим сообщение о рисовании круга.
        Console.WriteLine(
            "Нарисован круг."
        );
    }
    // Реализуем метод рисования прямоугольника.
    public void DrawRectangle()
    {
        // Выводим сообщение о рисовании прямоугольника.
        Console.WriteLine(
            "Нарисован прямоугольник."
        );
    }
}
class Program
{
    static void Main()
    {
        // Создаём объект класса Canvas.
        // Переменная имеет тип интерфейса IDrawing. Это позволяет обращаться к объекту через методы интерфейса.
        IDrawing canvas = new Canvas();
        // Вызываем метод рисования линии.
        canvas.DrawLine();
        // Вызываем метод рисования круга.
        canvas.DrawCircle();
        // Вызываем метод рисования прямоугольника.
        canvas.DrawRectangle();
    }
}